In [11]:
import pandas as pd
import numpy as np

In [12]:
dict1 = {"Name":["Tanush","Shubh","shreyansh","Aryan","Sharavand","Hrishik"],
        "Class":["9th","10th","8th","9th","8th","7th"],
         "Section":["D","E","c","A","B","F"],
        "Roll":["9437","10304","9332","8193","9871","6546"]}

In [13]:
print(dict1)

{'Name': ['Tanush', 'Shubh', 'shreyansh', 'Aryan', 'Sharavand', 'Hrishik'], 'Class': ['9th', '10th', '8th', '9th', '8th', '7th'], 'Section': ['D', 'E', 'c', 'A', 'B', 'F'], 'Roll': ['9437', '10304', '9332', '8193', '9871', '6546']}

In [14]:
df = pd.DataFrame(dict1) #It is used to change data in excel sheet

In [15]:
df

        Name Class Section   Roll
0     Tanush   9th       D   9437
1      Shubh  10th       E  10304
2  shreyansh   8th       c   9332
3      Aryan   9th       A   8193
4  Sharavand   8th       B   9871
5    Hrishik   7th       F   6546

In [16]:
df.to_csv('classroom') #To save the file

In [17]:
df.to_csv('classroom2',index=False) #Index = False is used so That You don't have any index

In [18]:
df.head(2)  # To print values from top

     Name Class Section   Roll
0  Tanush   9th       D   9437
1   Shubh  10th       E  10304

In [19]:
df.tail(2)   # To print them from last

        Name Class Section  Roll
4  Sharavand   8th       B  9871
5    Hrishik   7th       F  6546

In [20]:
df.describe()

         Name Class Section  Roll
count       6     6       6     6
unique      6     4       6     6
top     Aryan   9th       c  9332
freq        1     2       1     1

In [25]:
dict1['Name'][0] = "Fairy"           #To Change the value of the data

In [26]:
dict1

{'Name': ['Fairy', 'Shubh', 'shreyansh', 'Aryan', 'Sharavand', 'Hrishik'],
 'Class': ['9th', '10th', '8th', '9th', '8th', '7th'],
 'Section': ['D', 'E', 'c', 'A', 'B', 'F'],
 'Roll': ['9437', '10304', '9332', '8193', '9871', '6546']}